#### BuiltInFailures.ComponentRepeaterFailures Members

---

|  |
| --- |
| BuiltInFailures ComponentRepeaterFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ComponentRepeaterFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ComponentRepeater\_InvalidFamilyOnReload | Reloaded family not appropriate for repeater. |
| Public property Static member | ComponentRepeater\_ThereIsOnlyOneInstanceInThisRepeater | There is only one component in this repeater. |

# See Also

BuiltInFailures ComponentRepeaterFailures Class

Autodesk.Revit.DB Namespace